import keyword

person = 'happylay'
age = 18
gender = '男'

# --------------------------------------------------------------------------------
# sep默认分隔符是空格(sep='',end='\n')
print(person,age,gender)

print(person,age,gender,sep='-')

print('hello\nhappylay')

print('hello happy',end=' ')

print('hello lay',end='\n')

# --------------------------------------------------------------------------------
# type(变量名) 返回该变量的类型
# float
money=9.9
print(money,type(money))

# str
money='9.9元'
print(money,type(money))

# int
money=9
print(money,type(money))

# --------------------------------------------------------------------------------
# 变量的命名规范-字母、数字、下划线不能以数字开头、严格区分大小写
# python关键字
print(keyword.kwlist)

# 推荐使用下划线(python推荐)
pay_money = 100
print(pay_money)

# --------------------------------------------------------------------------------
# 格式化输出
print('快乐的%s,年龄%s'%(person,age))
print('年龄是：%d' % age)

# %.3f 四舍五入
salary = 9999.451234
print('薪水：%.3f'%salary)
# --------------------------------------------------------------------------------
# 强制类型转换
print('年龄'+str(age))

# --------------------------------------------------------------------------------
'''
多行注释
'''
# --------------------------------------------------------------------------------











